[
    "You eagerly count down the days on an advent calendar.",
    "You believe in Santa Claus and write him heartfelt letters.",
    "You wake up ridiculously early on Christmas morning, unable to contain your excitement.",
    "You believe in the magic of Christmas and the possibility of miracles.",
    "You make DIY Christmas ornaments.",
    "You decorate the Christmas tree with colorful ornaments and tinsel.",
    "You eagerly unwrap presents, tearing the wrapping paper with glee.",
    "You enjoy watching animated Christmas specials.",
    "You imagine what Santa's workshop is like.",
    "You attend Christmas-themed parties.",
    "You believe in the joyous spirit of giving and receiving gifts.",
    "You believe that reindeer can fly and pull Santa's sleigh.",
    "You get a sense of wonder from the twinkling lights and decorations.",
    "You leave out stockings for your pets, hoping they get a treat too.",
    "You wear festive pajamas on Christmas Eve.",
    "You believe that the elves help Santa make toys in his workshop.",
    "You take part in Secret Santa gift exchanges with friends and family.",
    "You anxiously wait for the sound of sleigh bells on Christmas Eve.",
    "You create holiday-themed crafts.",
    "You get excited about the possibility of seeing Santa at the mall.",
    "You listen to Christmas music on repeat throughout December.",
    "You eagerly watch for the arrival of the holiday-themed mall decorations.",
    "You make paper snowflakes to decorate windows and walls.",
    "You create a wish list for your favorite toy store or department store.",
    "You get excited about the first lighting of the Christmas tree.",
    "You watch classic Christmas movies like \"Home Alone\" and \"Elf.\"",
    "You wear reindeer antlers or Santa hats as part of your festive attire.",
    "You create handmade cards to give to friends and family.",
    "You help decorate the house with festive lights and ornaments.",
    "You believe in the magic of Christmas Eve and the anticipation of morning surprises.",
    "You attend Christmas-themed events and festivals in your community.",
    "You wear Christmas-themed socks to showcase your holiday spirit.",
    "You engage in friendly debates about the best Christmas cookies / cake / desserts.",
    "You participate in holiday-themed games and activities with friends.",
    "You strategically plan your holiday meals to maximize leftovers for days.",
    "You engage in a competitive gift-wrapping contest with friends.",
    "You use Christmas lights to decorate your entire living space, not just the tree.",
    "You exchange quirky and personalized Christmas cards with inside jokes.",
    "You sneak adult beverages into family gatherings to survive awkward conversations.",
    "You turn Christmas carols into hilariously inappropriate parodies.",
    "You wear ugly Christmas sweaters ironically and proudly.",
    "You strategically time your arrival at family gatherings to avoid extra chores.",
    "You create a holiday-themed drinking game for classic Christmas movies.",
    "You send your friends passive-aggressive Christmas memes instead of cards.",
    "You secretly regift items from last year's Christmas presents.",
    "You exchange gifts with friends but keep the receipts, just in case.",
    "You use Christmas lights year-round as \"ambient\" lighting in your home.",
    "You replace traditional ornaments with quirky pop culture references on the Christmas tree.",
    "You create a Christmas playlist featuring non-traditional, humorous songs.",
    "You take advantage of holiday sales to buy gifts for yourself.",
    "You exchange gifts with your friends that are only funny to your inside circle.",
    "You prank your friends with fake Christmas gift-wrapping, like a box within a box within a box.",
    "You use Christmas decorations to create a festive backdrop for Zoom meetings.",
    "You dress up your pets in ridiculous Christmas costumes for laughs.",
    "You start a \"Secret Santa\" with your coworkers just to see who gives the weirdest gifts.",
    "You use Christmas as an excuse to indulge in your favorite guilty pleasure foods.",
    "You replace traditional holiday dinner with a potluck of comfort foods.",
    "You send out a fake family Christmas newsletter filled with absurd achievements.",
    "You make a pact with friends to wear matching embarrassing holiday outfits.",
    "You turn the Christmas tree into a DIY art project with unconventional ornaments.",
    "You host a holiday-themed game night.",
    "You replace traditional holiday greetings with funny and sarcastic ones.",
    "You create a \"Santa's Naughty List\" and playfully put friends on it.",
    "You engage in a white elephant gift exchange with deliberately ridiculous items.",
    "You challenge your friends to a cookie decorating contest with unconventional toppings.",
    "You prank your roommates by wrapping their entire room in holiday wrapping paper.",
    "You started listening to humorous holiday-themed podcasts.",
    "You playfully photoshop Santa hats onto family photos for social media.",
    "You organize a \"Regift Swap\" party where everyone brings unwanted presents.",
    "You turn Christmas shopping into a competition to find the weirdest gifts.",
    "You create a holiday-themed TikTok dance with friends for social media laughs.",
    "You host a holiday movie marathon featuring the cheesiest and most absurd films.",
    "You organize a \"Christmas Karaoke\" night with hilarious song choices.",
    "You sneak away to indulge in post-holiday sales for yourself.",
    "You replace traditional holiday cards with funny e-cards and memes.",
    "You organize a holiday-themed costume contest with friends.",
    "You turn the traditional Christmas gift exchange into a quirky \"white elephant\" style.",
    "You create a humorous holiday-themed photo booth for parties.",
    "You organize a holiday-themed trivia night with funny and obscure facts.",
    "You use Christmas lights to create a festive \"mood\" in your bedroom.",
    "You turn Christmas dinner into a potluck of unconventional dishes.",
    "You turn gift-wrapping into a crafting session with friends.",
    "You engage in a friendly competition with neighbors for the most outrageous decorations.",
    "You playfully prank your roommates by wrapping their belongings in holiday paper.",
    "You create a holiday-themed Spotify playlist featuring unconventional and humorous songs."
]